/*Користувач вводить з клавіатури грошову суму в гривнях і копійках (гривні і копійки
вводити окремо в різні змінні). Сума може бути введена як правильно (наприклад 19
грн. 90 копійок), так і неправильно (наприклад 22 грн. 970 копійок). Написати
програму, яка здійснить коригування введеної грошової суми в правильну форму.
Наприклад, якщо користувач ввів 11 грн 150 копійок, програма має вивести на екран
суму 12 грн. 50 копійок.*/

#include <iostream>

using namespace std;

int main() 
{
	int grn, kop;
	cout << "Enter some money : ";
	cin >> grn;
	cout << "and some pennies : ";
	cin >> kop;

	grn+=kop / 100;
	kop %= 100;

	cout << "your savings are : " << grn << " gryvnyas and " << kop << " kopiykas" << endl;
}
